In [241]:
import pandas as pd
import FinanceDataReader as fdr
df_kos = fdr.StockListing('KOSPI')
df_ksq = fdr.StockListing('KOSDAQ')
df_etf_kr = fdr.StockListing('ETF/KR')
df_SP = fdr.StockListing('SP500')

In [244]:
df_kos=df_kos[0:400]
df_etf_kr=df_etf_kr[0:100]
df_ksq=df_ksq[0:100]

In [245]:
df_kos=df_kos['Code'].to_frame()
df_ksq=df_ksq['Code'].to_frame()

import pandas as pd
def make_code(x):
    x = str(x)
    return '0'*(6-len(x)) + x

KR = pd.read_html('http://kind.krx.co.kr/corpgeneral/corpList.do?method=download',header=0)[0]
KR['종목코드'] = KR['종목코드'].apply(make_code)
KR_list = KR[KR['상장일'] < '2018-01-01']['종목코드'].to_frame()

df_krx=df_Krx[df_Krx.duplicated()]
df_krx

df_krx

In [210]:
df_SP = df_SP['Symbol'].to_frame()
df_SP.columns = ['Code']
df_etf_kr = df_etf_kr['Symbol'].to_frame()
df_etf_kr.columns = ['Code']
df_SP.columns = ['Code']
df_Naq = df_NAQ['Symbol'].to_frame()
df_Naq.columns = ['Code']

In [233]:
df_etf_kr

       Code
0    069500
1    357870
2    423160
3    371460
4    252670
..      ...
195  276970
196  099140
197  371450
198  122260
199  407830

[200 rows x 1 columns]

In [234]:
Kr=df_kos
Kr_etf = df_etf_kr
AM=df_SP
list_kr = Kr['Code']
list_etf = Kr_etf
list_AM = AM['Code']

In [236]:
list_etf

       Code
0    069500
1    357870
2    423160
3    371460
4    252670
..      ...
195  276970
196  099140
197  371450
198  122260
199  407830

[200 rows x 1 columns]

In [237]:
from tqdm import tqdm
import time
start_time = time.time()

merge_stock_list_KR =[]
for code in tqdm(list_kr):
    stock_list = fdr.DataReader(code, '2000').reset_index().values.tolist() 
    
    for row in stock_list: 
        row.append(code)                 
        merge_stock_list_KR.append(row)

100%|██████████| 200/200 [00:21<00:00,  9.25it/s]

In [239]:
KR_list=pd.DataFrame(merge_stock_list_KR)[[0,4,5,6,7]]
KR_list

                0      4        5         6       7
0      2000-01-04   6110  1483967  0.148496  005930
1      2000-01-05   5580  1493604 -0.086743  005930
2      2000-01-06   5620  1087810  0.007168  005930
3      2000-01-07   5540   806195 -0.014235  005930
4      2000-01-10   5770   937615  0.041516  005930
...           ...    ...      ...       ...     ...
849648 2023-02-15  14950  1141801  0.012873  032350
849649 2023-02-16  14920   710741 -0.002007  032350
849650 2023-02-17  14590   598277 -0.022118  032350
849651 2023-02-20  14080   646791 -0.034955  032350
849652 2023-02-21  14160   527515  0.005682  032350

[849653 rows x 5 columns]

In [221]:
merge_stock_list_AM =[]
for code in tqdm(list_AM):
    stock_list = fdr.DataReader(code, '2000').reset_index().values.tolist() 
    
    for row in stock_list: 
        row.append(code)                 
        merge_stock_list_AM.append(row)

HTTP Error 404: Not Found  - symbol "BRKB"not found or invalid periods

HTTP Error 404: Not Found  - symbol "BFB"not found or invalid periods

HTTP Error 404: Not Found  - symbol "PPD"not found or invalid periods

100%|██████████| 703/703 [06:21<00:00,  1.84it/s]

In [240]:
US_list=pd.DataFrame(merge_stock_list_AM)
US_list[[0,4,5,6,7]]

                 0           4           5        6     7
0       2000-01-03   47.187500   25.525513  2173400   MMM
1       2000-01-04   45.312500   24.511253  2713800   MMM
2       2000-01-05   46.625000   25.221231  3699400   MMM
3       2000-01-06   50.375000   27.249758  5975800   MMM
4       2000-01-07   51.375000   27.790684  4101200   MMM
...            ...         ...         ...      ...   ...
3511110 2023-02-13  170.539993  170.539993   810300  JKHY
3511111 2023-02-14  166.559998  166.559998   553900  JKHY
3511112 2023-02-15  168.429993  168.429993   557600  JKHY
3511113 2023-02-16  165.160004  165.160004   527600  JKHY
3511114 2023-02-17  169.000000  169.000000   728900  JKHY

[3511115 rows x 5 columns]